tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jesseduffield/lazydocker"
tap "localstack/tap"
tap "stripe/stripe-cli"

brew "zstd"
brew "autoconf"
brew "automake"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "glib"
brew "coreutils"
brew "curl"
brew "doctl"
brew "fd"
brew "ffmpegthumbnailer"
brew "file"
brew "open-mpi"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gpgme"
brew "harfbuzz"
brew "pkg-config"
brew "httpie"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "libfido2"
brew "libpq"
brew "pango"
brew "librsvg"
brew "libxml2"
brew "libyaml"
brew "mas"
brew "mysql"
brew "neovim"
brew "nvm"
brew "openssl@1.1"
brew "openssl@3.0"
brew "tmux"
brew "overmind"
brew "pinentry-mac"
brew "poppler"
brew "postgresql@16"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "starship"
brew "taglib"
brew "tflint"
brew "tree"
brew "unar"
brew "vips"
brew "yazi"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"
brew "localstack/tap/localstack-cli"
brew "stripe/stripe-cli/stripe"

cask "1password-cli"
cask "font-fira-code", args: { appdir: "~/Applications" }
cask "font-fira-mono-nerd-font", args: { appdir: "~/Applications" }
cask "font-fira-mono", args: { appdir: "~/Applications" }
cask "font-geist", args: { appdir: "~/Applications" }
cask "font-geist-mono", args: { appdir: "~/Applications" }
cask "font-geist-mono-nerd-font", args: { appdir: "~/Applications" }
cask "font-go-mono-nerd-font", args: { appdir: "~/Applications" }
cask "font-hack-nerd-font", args: { appdir: "~/Applications" }
cask "font-hurmit-nerd-font", args: { appdir: "~/Applications" }
cask "font-meslo-lg-nerd-font", args: { appdir: "~/Applications" }
cask "font-monofur-nerd-font", args: { appdir: "~/Applications" }
cask "font-noto-nerd-font", args: { appdir: "~/Applications" }
cask "font-profont-nerd-font", args: { appdir: "~/Applications" }
cask "font-space-mono-nerd-font", args: { appdir: "~/Applications" }
cask "orbstack"
cask "alacritty"
cask "wezterm"

mas "1Password for Safari", id: 1569813296
mas "Adobe Lightroom", id: 1451544217
mas "Bear", id: 1091189122
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Notion Web Clipper", id: 1559269364
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
