# 'brew tap'
tap "homebrew/cask-fonts"
tap "sambadevi/powerlevel9k"
tap "buo/cask-upgrade"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "mas"
brew "powerlevel9k"
brew "coreutils"
brew "gnupg" if OS.mac?

brew "zsh"
brew "zsh-autosuggestions"
brew "starship"

brew "awscli"
brew "curl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "openssl@1.1"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "jq"
brew "yq"
brew "tree"

# Languages
brew "rbenv"
brew "ruby-build"

# NerdFonts
cask "font-noto-nerd-font"
cask "font-hack-nerd-font"

# instapaper
mas 1481302432 # save
mas 288545208 # mac app
