# 'brew tap'
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sambadevi/powerlevel9k"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
brew "jesseduffield/lazygit/lazygit"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "mas"
brew "powerlevel9k"
brew "coreutils"
brew "gnupg" if OS.mac?

brew "zsh"
brew "zsh-autosuggestions"
brew "starship"

brew "awscli"
brew "bat"
brew "curl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "httpie"
brew "jq"
brew "lazygit"
brew "mysql"
brew "neovim"
brew "openssl@1.1"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "yq"

# Languages
brew "rbenv"
brew "ruby-build"
brew "hashicorp/tap/terraform"
brew "pyenv"
brew "nvm"

# Dev tools
brew "orbstack"

# NerdFonts
cask "font-meslo-lg-nerd-font"
cask "font-noto-nerd-font"
cask "font-hack-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-monofur-nerd-font"
cask "font-profont-nerd-font"
cask "font-space-mono-nerd-font"

# instapaper
mas "Instapaper Save", id: 1481302432
mas "Instapaper", id: 288545208
mas "Bear App", id: 1091189122
mas "TickTick", id: 966085870
mas "Tailscale", id: 1475387142
